# 판다스 데이터 전처리 어드밴스

 데이터 전처리
- 데이터 형식에 대한 처리
    - 공백 문자
        - str.strip() : 양쪽 공백 제거
        - str.lstrip() : 왼쪽 공백 제거
        - str.rstip() : 오른쪽 공백 제거
    - 데이터 타입
    - 불규칙한 대소문자
    - 불규칙한 구분기호
    - 유효하지 않은 문자
    - 불규칙한 날짜 및 시간 표기

In [283]:
# 필요한 라이브러리 호출
import pandas as pd
import numpy as np

### 1.날짜형식 
    01. 날짜 데이터 1 : str 타입

In [284]:
# 01.날짜 데이터1 : str 타입
str_date = ['2022/11/01', '2022.10.31', '2022-10-21' ]

In [285]:
# 02.시리즈 형태로 저장
pd.Series(str_date)

# 이건 데이터 프레임으로 저장
# pd.DataFrame(str_date)

0    2022/11/01
1    2022.10.31
2    2022-10-21
dtype: object

In [286]:
# 03. Str 타입을 datetime 타입으로 변환 후  pandas 저장
# pd.to_datetime
pd.to_datetime(pd.to_datetime(str_date))
# pd.to_datetime(str_date)

DatetimeIndex(['2022-11-01', '2022-10-31', '2022-10-21'], dtype='datetime64[ns]', freq=None)

In [287]:
pd.Series(str_date).dtype
# dtype('O') -> 데이터타입 오브젝트라는 뜻입니다.

dtype('O')

In [288]:
# 04. str 타입으로 저장 후 데이터 타입 변경
# series.dtype : 데이터타입 확인
# series.astype() : 데이터타입 변경

pd.Series(str_date).astype('datetime64')
# datetime64로 변경하면 전부 -로 날짜가 나눠짐을 볼 수 있습니다.

0   2022-11-01
1   2022-10-31
2   2022-10-21
dtype: datetime64[ns]

### 1.날짜형식 
    02. 날짜 데이터 2 : timestamp 타입

In [289]:
# 날짜 데이터 2 : timestamp 타입
# timestamp : 기준시각(1970.01.01 00:00:00 UTC)로부터 몇초가 경과했는지 표기
# 1970년 1월 1일 00 시 부터 몇 초가 지났는지..
# 1970.01.01 00 : 01 : 00 UTC -> 60 
# 1970.01.01 01 : 00 : 00 UTC -> 3600 
stamp_date = [1234000, 1234101, 1234202, 1234300, 1234500]

In [290]:
pd.Series(stamp_date)

0    1234000
1    1234101
2    1234202
3    1234300
4    1234500
dtype: int64

In [291]:
# datetime 타입으로 변환 후 저장 
# timestamp의 기본 unit = ns(나노초) : 10억분의 1초
# unit = ns(Default), D(days), s(seconds), ms(milli seconds)m us(micro seconds)
pd.Series(pd.to_datetime(stamp_date))

# 0    1234000 -> 1970-01-01 부터 1234000 나노초 만큼 경과했습니다.

0   1970-01-01 00:00:00.001234000
1   1970-01-01 00:00:00.001234101
2   1970-01-01 00:00:00.001234202
3   1970-01-01 00:00:00.001234300
4   1970-01-01 00:00:00.001234500
dtype: datetime64[ns]

In [292]:
# unit = s
pd.Series(pd.to_datetime(stamp_date, unit = 's'))
# 0    1234000 -> 1970-01-01 부터 1234000 초 만큼 경과했습니다.

0   1970-01-15 06:46:40
1   1970-01-15 06:48:21
2   1970-01-15 06:50:02
3   1970-01-15 06:51:40
4   1970-01-15 06:55:00
dtype: datetime64[ns]

In [293]:
# unit = D
# 에러나는 이유 2038년 문제로 인한 에러
# pd.Series(pd.to_datetime(stamp_date, unit = 'D'))
# 0    1234000 -> 1970-01-01 부터 1234000 초 만큼 경과하려고했지만 2038문제로 에러가 검출되었습니다.

In [294]:
# unit = ms
pd.Series(pd.to_datetime(stamp_date, unit = 'ms'))
# 0    1234000 -> 1970-01-01 부터 1234000 밀리초 만큼 경과했습니다.

0   1970-01-01 00:20:34.000
1   1970-01-01 00:20:34.101
2   1970-01-01 00:20:34.202
3   1970-01-01 00:20:34.300
4   1970-01-01 00:20:34.500
dtype: datetime64[ns]

In [295]:
# unit = us
pd.Series(pd.to_datetime(stamp_date, unit = 'us'))
# 0    1234000 -> 1970-01-01 부터 1234000 마이크로초 만큼 경과했습니다.

0   1970-01-01 00:00:01.234000
1   1970-01-01 00:00:01.234101
2   1970-01-01 00:00:01.234202
3   1970-01-01 00:00:01.234300
4   1970-01-01 00:00:01.234500
dtype: datetime64[ns]

### 2.라벨 형식 통일
    01. 데이터 인코딩 작업에 포함

In [296]:
# 추가 팁 데이터 프레임 구성문법
df0 = pd.DataFrame({'ticker' : ['MSFT', 'F', 'JPM', 'AAPL'], 'stocks' : [30, 160, 40, 274]})
df0

  ticker  stocks
0   MSFT      30
1      F     160
2    JPM      40
3   AAPL     274

In [297]:
# map()
# dictionary 타입으로 encoding map을 생성해서 적용
# gender = 0(남성), 1(여성)
df = pd.DataFrame({'gender' : [0, 0, 0, 1, 0, 1]})
# gender_map 지정
gender_map = {0 : 'M', 1 : 'F'}
df

   gender
0       0
1       0
2       0
3       1
4       0
5       1

In [298]:
# df변수의 'gender' 컬럼값을 map 함수를 이용해 0은 M으로, 1은 F로 변환
# df의 gender 컬럼에 gender_map 적용 -> df다음에 꼭 컬럼을 적어줍시다
# 안그러면 에러납니다.(컴퓨터가 어디에 적용할지 모르기때문에 꼭 지정해줍니다.)
df['gender'].map(gender_map)

0    M
1    M
2    M
3    F
4    M
5    F
Name: gender, dtype: object

In [299]:
# 기존 파이썬 문법으로 바꾸기
# 찾아 바꾸기인 replace()를 써도 됩니다. 
# replace는 한번에 한개의 인자만 바꾸기 때문에 여러 인자를 바꾸려면 
# replace를 중복해서 사용해야 합니다.\

# ★ df다음에 꼭 컬럼을 적어줍시다 ★

# 방법 1
# df['gender'] = df['gender'].replace(0,'M')
# df['gender'] = df['gender'].replace(1,'F')

# 방법 2
df['gender'] = df['gender'].replace(0,'M').replace(1,'F')

# 방법 3
# df['gender'] = df['gender'].replace({0:'M', 1 : 'F'})

df

  gender
0      M
1      M
2      M
3      F
4      M
5      F

### 3.문자 형식(대소문자, 기호 등) 통일

In [300]:
# 컬럼명을 소문자로 바꾸는 예제연습 (for문을 쓰는 방법)
data = {'Name' : ["Jane", "Albert", 'John'],
        'Age' : [18, 19, 20 ]}
df1 = pd.DataFrame(data)
df1

# 이건 시리즈로 만드는 문법
# pd.Series(data)

     Name  Age
0    Jane   18
1  Albert   19
2    John   20

In [301]:
# 컬럼명을 소문자로 바꾸는 첫 번째 방법
# 빈 리스트에 소문자로 변경한 컬럼을 모두 적재한 뒤 대입
new_cols = list()
for col in df1.columns:
    print(col.lower())
    new_cols.append(col.lower())

name
age

In [302]:
df1.columns = new_cols
df1

     name  age
0    Jane   18
1  Albert   19
2    John   20

In [303]:
# 두번째 방법 이번에는 대문자로 다 바꿔보기
# df.columns에 바로 upper() 등을 걸 수 있음
# 위 코드를 이용하여 대문자로 교체하기
df1.columns = df1.columns.str.upper()
df1

     NAME  AGE
0    Jane   18
1  Albert   19
2    John   20

In [304]:
# 내부 요소의 모든 자료를 소문자로 통일
# age : 정수형이라 고칠 필요 X, 배제함
# 사용문법 : .apply(함수명)
# 해당함수의 리턴값으로 컬럼 내부 값을 일괄적으로 교체해주는 명령어

def change_lower(value):
    return value.lower()

In [305]:
# df의 NAME 컬럼에 change_lower 함수 적용합니다.
df1['NAME'].apply(change_lower)

0      jane
1    albert
2      john
Name: NAME, dtype: object

In [306]:
df1["NAME"].map(change_lower)

0      jane
1    albert
2      john
Name: NAME, dtype: object

In [307]:
df1['NAME']

0      Jane
1    Albert
2      John
Name: NAME, dtype: object

In [308]:
# Series 자료형에는 에러를 띄웁니다.
# 데이터프레임 뒤에 꼭 컬럼을 작성해주세요
# df1.apply(change_lower)
# df1

In [309]:
# apply뒤에는 모든 함수가 와도 괜찮습니다.
df1['NAME'].apply(id)

0    2035400609072
1    2035400606960
2    2035400606256
Name: NAME, dtype: int64

In [310]:
# AGE 컬럼의 값을 20이상이면 성인 19이하면 미성년자
# 를 리턴하는 is_adult함수를 정의하고
# .apply()로 활용해 값을 일괄적으로 변경해주세요.
df1

     NAME  AGE
0    Jane   18
1  Albert   19
2    John   20

In [311]:
# AGE 컬럼 전용 is_adult 함수 제작
def is_adult(value):
    if value >= 20:
        return "성인"
    else :
        return '미성년자'

In [312]:
# 데이터프레임 AGE 컬럼에 is_adult 함수적용
df1['AGE'].apply(is_adult)

0    미성년자
1    미성년자
2      성인
Name: AGE, dtype: object

In [313]:
df1["ADULT"] = df1['AGE'].apply(is_adult)
df1

     NAME  AGE ADULT
0    Jane   18  미성년자
1  Albert   19  미성년자
2    John   20    성인

In [314]:
df1["adult"] = df1['AGE'].apply(is_adult)
df1

     NAME  AGE ADULT adult
0    Jane   18  미성년자  미성년자
1  Albert   19  미성년자  미성년자
2    John   20    성인    성인

In [315]:
df1 = df1.drop('adult', axis = 1)
df1

     NAME  AGE ADULT
0    Jane   18  미성년자
1  Albert   19  미성년자
2    John   20    성인

In [316]:
# 복습예제
# 문제 1 : NaMe 컬럼을 소문자로 변환하세요(for문 과 다른 방법 2가지로 풀어보세요)
# 문제 2 : JASON, CATHERINE을 소문자로 만드세요
# 문제 3 : 17세 이상은 senior 미만은 junior 클래스로 구분하는 컬럼을 추가해보세요
# 문제 4 : 기존에 있던 grade 컬럼을 삭제하세요
students = {'NaMe' : ['JASON', 'mike', 'julia', 'CATHERINE'], 'age' : [16, 15, 18, 17], 'grade' : ['B+', 'B', 'A', 'A+']}
students_df = pd.DataFrame(students)
students_df

        NaMe  age grade
0      JASON   16    B+
1       mike   15     B
2      julia   18     A
3  CATHERINE   17    A+

In [317]:
# 문제1 풀이(for 문)
trans_cols = []

for cols in students_df.columns:
    trans_cols.append(cols.lower())

students_df.columns = trans_cols
students_df

# 문제1 풀이(다른 방법)
students_df.columns = students_df.columns.str.lower()
students_df

        name  age grade
0      JASON   16    B+
1       mike   15     B
2      julia   18     A
3  CATHERINE   17    A+

In [318]:
# 문제2 풀이 - 1
def trans_lower (value):
    return value.lower()

In [319]:
# 문제2 풀이 - 2
students_df['name'] = students_df['name'].apply(trans_lower)
students_df

        name  age grade
0      jason   16    B+
1       mike   15     B
2      julia   18     A
3  catherine   17    A+

In [320]:
# 문제3 풀이 - 1
def class_classifier(value):
    if value >= 17 :
        return 'senior'
    else : 
        return 'junior'

In [321]:
# 문제3 풀이 - 2
students_df['class'] = students_df['age'].apply(class_classifier)
students_df

        name  age grade   class
0      jason   16    B+  junior
1       mike   15     B  junior
2      julia   18     A  senior
3  catherine   17    A+  senior

In [324]:
# 문제4 풀이 
students_df = students_df.drop('grade', axis = 1)
students_df

        name  age   class
0      jason   16  junior
1       mike   15  junior
2      julia   18  senior
3  catherine   17  senior